astb_relise/src/Documents/ПереносЗимнейПотребности/ПереносЗимнейПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереносЗимнейПотребности</name>
  <registerRecords>AccumulationRegister.ПотребностьВыдачиСИЗ</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПериодыЗимы</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоЗимы</name>
      <type>
        <types>EnumRef.МесяцыГода</types>
      </type>
    </attributes>
    <attributes>
      <name>КонецЗимы</name>
      <type>
        <types>EnumRef.МесяцыГода</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальнаяДатаБудущейЗимы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечнаяДатаБудущейЗимы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/InformationRegisters/ПериодыЗимы/ПериодыЗимы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПериодыЗимы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НачалоЗимы</name>
    <type>
      <types>EnumRef.МесяцыГода</types>
    </type>
  </resources>
  <resources>
    <name>КонецЗимы</name>
    <type>
      <types>EnumRef.МесяцыГода</types>
    </type>
  </resources>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Documents/ПереносЗимнейПотребности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	//по регистру "ПотребностьВыдачиСИЗ"
	ТаблицыДляДвижений.Вставить("ТаблицаПотребностьВыдачиСИЗ", ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуДвиженийПоПотребности(ДокументСсылка));
	
	//по регистру "ВыдачаПоПотребности"
	ТаблицыДляДвижений.Вставить("ТаблицаВыдачаПоПотребности", ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуДвиженийВыдачиПоПотребности(ДокументСсылка,ТаблицыДляДвижений.ТаблицаПотребностьВыдачиСИЗ));
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧасть(ТекущийОбъект) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПериодыЗимыСрезПоследних.Подразделение,
	|	ПериодыЗимыСрезПоследних.НачалоЗимы,
	|	ПериодыЗимыСрезПоследних.КонецЗимы
	|ИЗ
	|	РегистрСведений.ПериодыЗимы.СрезПоследних(&Период, Организация = &Организация) КАК ПериодыЗимыСрезПоследних
	|ГДЕ
	|	ПериодыЗимыСрезПоследних.Использовать";
	
	Запрос.УстановитьПараметр("Период",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",ТекущийОбъект.Организация);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		СтруктураПериодаЗимы = ПроцедурыРаботыСНормамиСервер.ПолучитьПериодЗимы(ТекущийОбъект.Дата,СтрокаТаблицыЗапроса.НачалоЗимы,СтрокаТаблицыЗапроса.КонецЗимы);
		
		НачальнаяДатаБудущейЗимы 	= СтруктураПериодаЗимы.НачалоЗимы;
		КонечнаяДатаБудущейЗимы 	= СтруктураПериодаЗимы.КонецЗимы;
		
		НоваяСтрока = ТекущийОбъект.ПериодыЗимы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыЗапроса);
		НоваяСтрока.НачальнаяДатаБудущейЗимы   = НачальнаяДатаБудущейЗимы;
		НоваяСтрока.КонечнаяДатаБудущейЗимы    = КонечнаяДатаБудущейЗимы;
		
	КонецЦикла;

КонецПроцедуры
	
#КонецЕсли
